zevorn/qemu/hw/net/can/stm32g474_fdcan.c
/*
 * STM32G474 flexible data-rate CAN subsystem
 *
 * Copyright (c) 2026 Process Mission
 *
 * SPDX-License-Identifier: GPL-2.0-or-later
 */

#include "qemu/osdep.h"
#include "qapi/error.h"
#include "hw/core/qdev-clock.h"
#include "hw/core/qdev-properties.h"
#include "hw/core/irq.h"
#include "hw/net/stm32g474_fdcan.h"
#include "hw/core/registerfields.h"
#include "migration/vmstate.h"
#include "qemu/bitops.h"
#include "qemu/module.h"

REG32(CREL, 0x000)
    FIELD(CREL, DAY, 0, 8)
    FIELD(CREL, MON, 8, 8)
    FIELD(CREL, YEAR, 16, 4)
    FIELD(CREL, SUBSTEP, 20, 4)
    FIELD(CREL, STEP, 24, 4)
    FIELD(CREL, REL, 28, 4)
REG32(ENDN, 0x004)
    FIELD(ENDN, ETV, 0, 32)
REG32(DBTP, 0x00c)
    FIELD(DBTP, DSJW, 0, 4)
    FIELD(DBTP, DTSEG2, 4, 4)
    FIELD(DBTP, DTSEG1, 8, 5)
    FIELD(DBTP, DBRP, 16, 5)
    FIELD(DBTP, TDC, 23, 1)
REG32(TEST, 0x010)
    FIELD(TEST, LBCK, 4, 1)
    FIELD(TEST, TX, 5, 2)
    FIELD(TEST, RX, 7, 1)
REG32(RWD, 0x014)
    FIELD(RWD, WDC, 0, 8)
    FIELD(RWD, WDV, 8, 8)
REG32(CCCR, 0x018)
    FIELD(CCCR, INIT, 0, 1)
    FIELD(CCCR, CCE, 1, 1)
    FIELD(CCCR, ASM, 2, 1)
    FIELD(CCCR, CSA, 3, 1)
    FIELD(CCCR, CSR, 4, 1)
    FIELD(CCCR, MON, 5, 1)
    FIELD(CCCR, DAR, 6, 1)
    FIELD(CCCR, TEST, 7, 1)
    FIELD(CCCR, FDOE, 8, 1)
    FIELD(CCCR, BRSE, 9, 1)
    FIELD(CCCR, PXHD, 12, 1)
    FIELD(CCCR, EFBI, 13, 1)
    FIELD(CCCR, TXP, 14, 1)
    FIELD(CCCR, NISO, 15, 1)
REG32(NBTP, 0x01c)
    FIELD(NBTP, NTSEG2, 0, 7)
    FIELD(NBTP, NTSEG1, 8, 8)
    FIELD(NBTP, NBRP, 16, 9)
    FIELD(NBTP, NSJW, 25, 7)
REG32(TSCC, 0x020)
    FIELD(TSCC, TSS, 0, 2)
    FIELD(TSCC, TCP, 16, 4)
REG32(TSCV, 0x024)
    FIELD(TSCV, TSC, 0, 16)
REG32(TOCC, 0x028)
    FIELD(TOCC, ETOC, 0, 1)
    FIELD(TOCC, TOS, 1, 2)
    FIELD(TOCC, TOP, 16, 16)
REG32(TOCV, 0x02c)
    FIELD(TOCV, TOC, 0, 16)
REG32(ECR, 0x040)
    FIELD(ECR, TEC, 0, 8)
    FIELD(ECR, REC, 8, 7)
    FIELD(ECR, RP, 15, 1)
    FIELD(ECR, CEL, 16, 8)
REG32(PSR, 0x044)
    FIELD(PSR, LEC, 0, 3)
    FIELD(PSR, ACT, 3, 2)
    FIELD(PSR, EP, 5, 1)
    FIELD(PSR, EW, 6, 1)
    FIELD(PSR, BO, 7, 1)
    FIELD(PSR, DLEC, 8, 3)
    FIELD(PSR, RESI, 11, 1)
    FIELD(PSR, RBRS, 12, 1)
    FIELD(PSR, REDL, 13, 1)
    FIELD(PSR, PXE, 14, 1)
    FIELD(PSR, TDCV, 16, 7)
REG32(TDCR, 0x048)
    FIELD(TDCR, TDCF, 0, 7)
    FIELD(TDCR, TDCO, 8, 7)
REG32(IR, 0x050)
    FIELD(IR, RF0N, 0, 1)
    FIELD(IR, RF0F, 1, 1)
    FIELD(IR, RF0L, 2, 1)
    FIELD(IR, RF1N, 3, 1)
    FIELD(IR, RF1F, 4, 1)
    FIELD(IR, RF1L, 5, 1)
    FIELD(IR, HPM, 6, 1)
    FIELD(IR, TC, 7, 1)
    FIELD(IR, TCF, 8, 1)
    FIELD(IR, TFE, 9, 1)
    FIELD(IR, TEFN, 10, 1)
    FIELD(IR, TEFF, 11, 1)
    FIELD(IR, TEFL, 12, 1)
    FIELD(IR, TSW, 13, 1)
    FIELD(IR, MRAF, 14, 1)
    FIELD(IR, TOO, 15, 1)
    FIELD(IR, ELO, 16, 1)
    FIELD(IR, EP, 17, 1)
    FIELD(IR, EW, 18, 1)
    FIELD(IR, BO, 19, 1)
    FIELD(IR, WDI, 20, 1)
    FIELD(IR, PEA, 21, 1)
    FIELD(IR, PED, 22, 1)
    FIELD(IR, ARA, 23, 1)
REG32(IE, 0x054)
REG32(ILS, 0x058)
    FIELD(ILS, RXFIFO0, 0, 1)
    FIELD(ILS, RXFIFO1, 1, 1)
    FIELD(ILS, SMSG, 2, 1)
    FIELD(ILS, TFERR, 3, 1)
    FIELD(ILS, MISC, 4, 1)
    FIELD(ILS, BERR, 5, 1)
    FIELD(ILS, PERR, 6, 1)
REG32(ILE, 0x05c)
    FIELD(ILE, EINT0, 0, 1)
    FIELD(ILE, EINT1, 1, 1)
REG32(RXGFC, 0x080)
    FIELD(RXGFC, RRFE, 0, 1)
    FIELD(RXGFC, RRFS, 1, 1)
    FIELD(RXGFC, ANFE, 2, 2)
    FIELD(RXGFC, ANFS, 4, 2)
    FIELD(RXGFC, F1OM, 8, 1)
    FIELD(RXGFC, F0OM, 9, 1)
    FIELD(RXGFC, LSS, 16, 5)
    FIELD(RXGFC, LSE, 24, 4)
REG32(XIDAM, 0x084)
    FIELD(XIDAM, EIDM, 0, 29)
REG32(HPMS, 0x088)
    FIELD(HPMS, BIDX, 0, 3)
    FIELD(HPMS, MSI, 6, 2)
    FIELD(HPMS, FIDX, 8, 5)
    FIELD(HPMS, FLST, 15, 1)
REG32(RXF0S, 0x090)
    FIELD(RXF0S, F0FL, 0, 4)
    FIELD(RXF0S, F0GI, 8, 2)
    FIELD(RXF0S, F0PI, 16, 2)
    FIELD(RXF0S, F0F, 24, 1)
    FIELD(RXF0S, RF0L, 25, 1)
REG32(RXF0A, 0x094)
    FIELD(RXF0A, F0AI, 0, 3)
REG32(RXF1S, 0x098)
    FIELD(RXF1S, F1FL, 0, 4)
    FIELD(RXF1S, F1GI, 8, 2)
    FIELD(RXF1S, F1PI, 16, 2)
    FIELD(RXF1S, F1F, 24, 1)
    FIELD(RXF1S, RF1L, 25, 1)
REG32(RXF1A, 0x09c)
    FIELD(RXF1A, F1AI, 0, 3)
REG32(TXBC, 0x0c0)
    FIELD(TXBC, TFQM, 24, 1)
REG32(TXFQS, 0x0c4)
    FIELD(TXFQS, TFFL, 0, 3)
    FIELD(TXFQS, TFGI, 8, 2)
    FIELD(TXFQS, TFQPI, 16, 2)
    FIELD(TXFQS, TFQF, 21, 1)
REG32(TXBRP, 0x0c8)
    FIELD(TXBRP, TRP, 0, 3)
REG32(TXBAR, 0x0cc)
    FIELD(TXBAR, AR, 0, 3)
REG32(TXBCR, 0x0d0)
    FIELD(TXBCR, CR, 0, 3)
REG32(TXBTO, 0x0d4)
    FIELD(TXBTO, TO, 0, 3)
REG32(TXBCF, 0x0d8)
    FIELD(TXBCF, CF, 0, 3)
REG32(TXBTIE, 0x0dc)
    FIELD(TXBTIE, TIE, 0, 3)
REG32(TXBCIE, 0x0e0)
    FIELD(TXBCIE, CFIE, 0, 3)
REG32(TXEFS, 0x0e4)
    FIELD(TXEFS, EFFL, 0, 3)
    FIELD(TXEFS, EFGI, 8, 2)
    FIELD(TXEFS, EFPI, 16, 2)
    FIELD(TXEFS, EFF, 24, 1)
    FIELD(TXEFS, TEFL, 25, 1)
REG32(TXEFA, 0x0e8)
    FIELD(TXEFA, EFAI, 0, 2)
REG32(CKDIV, 0x100)
    FIELD(CKDIV, PDIV, 0, 4)

#define STM32G474_FDCAN_COMMON_NUM_DESCRIPTORS 36
#define STM32G474_FDCAN_NUM_IRQ_GROUPS 7
#define STM32G474_FDCAN_TX_BUFFER_MASK 0x00000007U
#define STM32G474_FDCAN_IR_MASK 0x00ffffffU
#define STM32G474_FDCAN_ILS_MASK 0x0000007fU

#define STM32G474_FDCAN_CCCR_MODE_MASK \
    (R_CCCR_ASM_MASK | R_CCCR_MON_MASK | R_CCCR_DAR_MASK | \
     R_CCCR_TEST_MASK | R_CCCR_FDOE_MASK | R_CCCR_BRSE_MASK | \
     R_CCCR_PXHD_MASK | R_CCCR_EFBI_MASK | R_CCCR_TXP_MASK | \
     R_CCCR_NISO_MASK)

#define STM32G474_FDCAN_RSVD(mask) (UINT32_MAX & ~(uint32_t)(mask))

static const MCanMsgRamLayout stm32g474_fdcan_mram_layout = {
    .std_filter = 0x000,
    .ext_filter = 0x070,
    .rx_fifo = { 0x0b0, 0x188 },
    .tx_event = 0x260,
    .tx_buffer = 0x278,
    .std_filters = 28,
    .ext_filters = 8,
    .rx_elements = { 3, 3 },
    .tx_events = 3,
    .tx_buffers = 3,
};

static const uint32_t stm32g474_fdcan_irq_group_masks[] = {
    0x000007,
    0x000038,
    0x0001c0,
    0x001e00,
    0x00e000,
    0x030000,
    0xfc0000,
};

static const uint32_t stm32g474_fdcan_engine_event_ir[] = {
    R_IR_RF0N_MASK,
    R_IR_RF0F_MASK,
    R_IR_RF0L_MASK,
    R_IR_RF1N_MASK,
    R_IR_RF1F_MASK,
    R_IR_RF1L_MASK,
    R_IR_HPM_MASK,
    R_IR_TEFN_MASK,
    R_IR_TEFF_MASK,
    R_IR_TEFL_MASK,
};

static bool stm32g474_fdcan_in_reset(const Stm32g474FdcanState *s)
{
    return s->resetting || s->peripheral_reset_asserted;
}

static void
stm32g474_fdcan_update_irq(Stm32g474FdcanChannel *channel)
{
    uint32_t pending =
        channel->regs[R_IR] & channel->regs[R_IE] &
        STM32G474_FDCAN_IR_MASK;
    uint32_t routed[STM32G474_FDCAN_NUM_IRQS] = { 0 };
    uint32_t ils = channel->regs[R_ILS];
    uint32_t ile = channel->regs[R_ILE];

    for (unsigned int group = 0;
         group < ARRAY_SIZE(stm32g474_fdcan_irq_group_masks); group++) {
        unsigned int line = (ils & BIT(group)) != 0;

        routed[line] |=
            pending & stm32g474_fdcan_irq_group_masks[group];
    }

    qemu_set_irq(channel->irq[0],
                 (ile & R_ILE_EINT0_MASK) && routed[0]);
    qemu_set_irq(channel->irq[1],
                 (ile & R_ILE_EINT1_MASK) && routed[1]);
}

static void
stm32g474_fdcan_sync_rx_fifo(Stm32g474FdcanChannel *channel,
                              unsigned int fifo)
{
    MCanFifoStatus status =
        m_can_rx_fifo_status(&channel->engine, fifo);
    uint32_t value = 0;

    if (fifo == 0) {
        value = FIELD_DP32(value, RXF0S, F0FL, status.fill);
        value = FIELD_DP32(value, RXF0S, F0GI, status.get_index);
        value = FIELD_DP32(value, RXF0S, F0PI, status.put_index);
        value = FIELD_DP32(value, RXF0S, F0F, status.full);
        value = FIELD_DP32(value, RXF0S, RF0L, status.lost);
        channel->regs[R_RXF0S] = value;
    } else {
        value = FIELD_DP32(value, RXF1S, F1FL, status.fill);
        value = FIELD_DP32(value, RXF1S, F1GI, status.get_index);
        value = FIELD_DP32(value, RXF1S, F1PI, status.put_index);
        value = FIELD_DP32(value, RXF1S, F1F, status.full);
        value = FIELD_DP32(value, RXF1S, RF1L, status.lost);
        channel->regs[R_RXF1S] = value;
    }
}

static void
stm32g474_fdcan_sync_tx_event_fifo(Stm32g474FdcanChannel *channel)
{
    MCanFifoStatus status =
        m_can_tx_event_status(&channel->engine);
    uint32_t value = 0;

    value = FIELD_DP32(value, TXEFS, EFFL, status.fill);
    value = FIELD_DP32(value, TXEFS, EFGI, status.get_index);
    value = FIELD_DP32(value, TXEFS, EFPI, status.put_index);
    value = FIELD_DP32(value, TXEFS, EFF, status.full);
    value = FIELD_DP32(value, TXEFS, TEFL, status.lost);
    channel->regs[R_TXEFS] = value;
}

static void
stm32g474_fdcan_sync_high_priority(Stm32g474FdcanChannel *channel)
{
    MCanHighPriorityState status =
        m_can_high_priority_status(&channel->engine);
    uint32_t value = 0;

    if (status.valid) {
        value = FIELD_DP32(value, HPMS, BIDX, status.buffer_index);
        value = FIELD_DP32(value, HPMS, MSI, status.storage);
        value = FIELD_DP32(value, HPMS, FIDX, status.filter_index);
        value = FIELD_DP32(value, HPMS, FLST, status.extended);
    }
    channel->regs[R_HPMS] = value;
}

static void
stm32g474_fdcan_sync_tx_queue(Stm32g474FdcanChannel *channel)
{
    uint32_t pending =
        channel->regs[R_TXBRP] & STM32G474_FDCAN_TX_BUFFER_MASK;
    uint32_t free_mask = ~pending & STM32G474_FDCAN_TX_BUFFER_MASK;
    unsigned int fill = ctpop32(pending);
    unsigned int get_index = pending ? ctz32(pending) : 0;
    unsigned int put_index = free_mask ? ctz32(free_mask) : 0;
    uint32_t value = 0;

