zevorn/qemu/hw/net/can/stm32g474_fdcan.c
    value = FIELD_DP32(value, TXFQS, TFFL,
                       stm32g474_fdcan_mram_layout.tx_buffers - fill);
    value = FIELD_DP32(value, TXFQS, TFGI, get_index);
    value = FIELD_DP32(value, TXFQS, TFQPI, put_index);
    value = FIELD_DP32(value, TXFQS, TFQF,
                       fill == stm32g474_fdcan_mram_layout.tx_buffers);
    channel->regs[R_TXFQS] = value;
}

static void
stm32g474_fdcan_sync_dynamic_status(Stm32g474FdcanChannel *channel)
{
    stm32g474_fdcan_sync_rx_fifo(channel, 0);
    stm32g474_fdcan_sync_rx_fifo(channel, 1);
    stm32g474_fdcan_sync_tx_event_fifo(channel);
    stm32g474_fdcan_sync_high_priority(channel);
    stm32g474_fdcan_sync_tx_queue(channel);
}

static MCanNonmatching stm32g474_fdcan_nonmatching(unsigned int field)
{
    switch (field) {
    case 0:
        return M_CAN_NONMATCHING_FIFO0;
    case 1:
        return M_CAN_NONMATCHING_FIFO1;
    default:
        return M_CAN_NONMATCHING_REJECT;
    }
}

static uint64_t
stm32g474_fdcan_effective_clock_hz(const Stm32g474FdcanState *s)
{
    uint64_t kernel_hz = clock_get_hz(s->kernel_clk);
    unsigned int ckdiv =
        FIELD_EX32(s->channel[0].regs[R_CKDIV], CKDIV, PDIV);
    unsigned int divisor = ckdiv ? 2 * ckdiv : 1;

    return kernel_hz / divisor;
}

static void stm32g474_fdcan_get_engine_config(void *opaque,
                                               MCanEngineConfig *config)
{
    Stm32g474FdcanChannel *channel = opaque;
    Stm32g474FdcanState *s = channel->parent;
    uint32_t cccr = channel->regs[R_CCCR];
    uint32_t rxgfc = channel->regs[R_RXGFC];
    uint64_t effective_hz = stm32g474_fdcan_effective_clock_hz(s);

    *config = (MCanEngineConfig) {
        .enabled = !stm32g474_fdcan_in_reset(s) &&
                   effective_hz != 0 &&
                   effective_hz <= clock_get_hz(s->pclk) &&
                   !(cccr & (R_CCCR_INIT_MASK | R_CCCR_CSR_MASK)),
        .fd_enabled = (cccr & R_CCCR_FDOE_MASK) != 0,
        .brs_enabled = (cccr & R_CCCR_BRSE_MASK) != 0,
        .reject_remote_standard =
            (rxgfc & R_RXGFC_RRFS_MASK) != 0,
        .reject_remote_extended =
            (rxgfc & R_RXGFC_RRFE_MASK) != 0,
        .rx_fifo_overwrite = {
            (rxgfc & R_RXGFC_F0OM_MASK) != 0,
            (rxgfc & R_RXGFC_F1OM_MASK) != 0,
        },
        .std_filters = FIELD_EX32(rxgfc, RXGFC, LSS),
        .ext_filters = FIELD_EX32(rxgfc, RXGFC, LSE),
        .nonmatching_standard = stm32g474_fdcan_nonmatching(
            FIELD_EX32(rxgfc, RXGFC, ANFS)),
        .nonmatching_extended = stm32g474_fdcan_nonmatching(
            FIELD_EX32(rxgfc, RXGFC, ANFE)),
        .extended_id_mask =
            FIELD_EX32(channel->regs[R_XIDAM], XIDAM, EIDM),
    };
}

static void stm32g474_fdcan_engine_event(void *opaque, uint32_t events)
{
    Stm32g474FdcanChannel *channel = opaque;
    Stm32g474FdcanState *s = channel->parent;
    uint32_t ir = 0;

    if (stm32g474_fdcan_in_reset(s)) {
        return;
    }

    for (unsigned int i = 0;
         i < ARRAY_SIZE(stm32g474_fdcan_engine_event_ir); i++) {
        if (events & BIT(i)) {
            ir |= stm32g474_fdcan_engine_event_ir[i];
        }
    }

    stm32g474_fdcan_sync_dynamic_status(channel);
    channel->regs[R_IR] |= ir;
    stm32g474_fdcan_update_irq(channel);
}

static const MCanEngineOps stm32g474_fdcan_engine_ops = {
    .get_config = stm32g474_fdcan_get_engine_config,
    .event = stm32g474_fdcan_engine_event,
};

static uint32_t stm32g474_fdcan_register_value(RegisterInfo *reg)
{
    return *(uint32_t *)reg->data;
}

static uint64_t
stm32g474_fdcan_protected_pre_write(RegisterInfo *reg, uint64_t val)
{
    Stm32g474FdcanChannel *channel = reg->opaque;
    uint32_t cccr = channel->regs[R_CCCR];

    if ((cccr & (R_CCCR_INIT_MASK | R_CCCR_CCE_MASK)) ==
        (R_CCCR_INIT_MASK | R_CCCR_CCE_MASK)) {
        return val;
    }
    return stm32g474_fdcan_register_value(reg);
}

static uint64_t
stm32g474_fdcan_test_pre_write(RegisterInfo *reg, uint64_t val)
{
    Stm32g474FdcanChannel *channel = reg->opaque;

    if (channel->regs[R_CCCR] & R_CCCR_TEST_MASK) {
        return val;
    }
    return stm32g474_fdcan_register_value(reg);
}

static uint64_t
stm32g474_fdcan_cccr_pre_write(RegisterInfo *reg, uint64_t val)
{
    Stm32g474FdcanChannel *channel = reg->opaque;
    uint32_t old = channel->regs[R_CCCR];
    uint32_t value = val;
    uint32_t rising_modes;

    if (!(old & R_CCCR_INIT_MASK)) {
        value = (value & ~R_CCCR_CCE_MASK) |
                (old & R_CCCR_CCE_MASK);
    }
    if (!(value & R_CCCR_INIT_MASK)) {
        value &= ~R_CCCR_CCE_MASK;
    }

    rising_modes = value & ~old & STM32G474_FDCAN_CCCR_MODE_MASK;
    if ((old & (R_CCCR_INIT_MASK | R_CCCR_CCE_MASK)) !=
        (R_CCCR_INIT_MASK | R_CCCR_CCE_MASK)) {
        value &= ~rising_modes;
    }

    channel->cccr_old = old;
    channel->cccr_write_pending = true;
    return value;
}

static void
stm32g474_fdcan_sync_cccr_status(Stm32g474FdcanChannel *channel)
{
    if (channel->regs[R_CCCR] & R_CCCR_CSR_MASK) {
        channel->regs[R_CCCR] |= R_CCCR_CSA_MASK;
    } else {
        channel->regs[R_CCCR] &= ~R_CCCR_CSA_MASK;
    }
}

static void
stm32g474_fdcan_cccr_post_write(RegisterInfo *reg, uint64_t val)
{
    Stm32g474FdcanChannel *channel = reg->opaque;
    Stm32g474FdcanState *s = channel->parent;
    uint32_t old;

    if (s->resetting || !channel->cccr_write_pending) {
        channel->cccr_write_pending = false;
        return;
    }

    old = channel->cccr_old;
    channel->cccr_write_pending = false;

    stm32g474_fdcan_sync_cccr_status(channel);

    if ((old & R_CCCR_TEST_MASK) &&
        !(channel->regs[R_CCCR] & R_CCCR_TEST_MASK)) {
        register_reset(&channel->regs_info[R_TEST]);
    }
}

static uint64_t
stm32g474_fdcan_tscv_pre_write(RegisterInfo *reg, uint64_t val)
{
    Stm32g474FdcanChannel *channel = reg->opaque;

    if (FIELD_EX32(channel->regs[R_TSCC], TSCC, TSS) == 1) {
        return 0;
    }
    return stm32g474_fdcan_register_value(reg);
}

static uint64_t
stm32g474_fdcan_tocv_pre_write(RegisterInfo *reg, uint64_t val)
{
    Stm32g474FdcanChannel *channel = reg->opaque;

    if (FIELD_EX32(channel->regs[R_TOCC], TOCC, TOS) == 0) {
        return FIELD_EX32(channel->regs[R_TOCC], TOCC, TOP);
    }
    return stm32g474_fdcan_register_value(reg);
}

static uint64_t
stm32g474_fdcan_psr_post_read(RegisterInfo *reg, uint64_t val)
{
    Stm32g474FdcanChannel *channel = reg->opaque;
    uint32_t value = channel->regs[R_PSR];

    value = FIELD_DP32(value, PSR, LEC, 7);
    value = FIELD_DP32(value, PSR, DLEC, 7);
    value &= ~(R_PSR_PXE_MASK | R_PSR_REDL_MASK |
               R_PSR_RBRS_MASK | R_PSR_RESI_MASK);
    channel->regs[R_PSR] = value;
    return val;
}

static void
stm32g474_fdcan_irq_post_write(RegisterInfo *reg, uint64_t val)
{
    Stm32g474FdcanChannel *channel = reg->opaque;

    if (!stm32g474_fdcan_in_reset(channel->parent)) {
        stm32g474_fdcan_update_irq(channel);
    }
}

static void
stm32g474_fdcan_ir_post_write(RegisterInfo *reg, uint64_t val)
{
    Stm32g474FdcanChannel *channel = reg->opaque;
    Stm32g474FdcanState *s = channel->parent;

