zevorn/qemu/hw/net/can/stm32g474_fdcan.c
    if (s->resetting || !s->engines_initialized) {
        return;
    }

    if (!(channel->regs[R_IR] & R_IR_RF0L_MASK)) {
        m_can_rx_fifo_clear_lost(&channel->engine, 0);
    }
    if (!(channel->regs[R_IR] & R_IR_RF1L_MASK)) {
        m_can_rx_fifo_clear_lost(&channel->engine, 1);
    }
    if (!(channel->regs[R_IR] & R_IR_TEFL_MASK)) {
        m_can_tx_event_clear_lost(&channel->engine);
    }
    stm32g474_fdcan_sync_dynamic_status(channel);
    stm32g474_fdcan_update_irq(channel);
}

static void
stm32g474_fdcan_rxf0a_post_write(RegisterInfo *reg, uint64_t val)
{
    Stm32g474FdcanChannel *channel = reg->opaque;

    if (!stm32g474_fdcan_in_reset(channel->parent) &&
        channel->parent->engines_initialized) {
        m_can_rx_fifo_ack(&channel->engine, 0,
                          FIELD_EX32(val, RXF0A, F0AI));
        stm32g474_fdcan_sync_rx_fifo(channel, 0);
    }
}

static void
stm32g474_fdcan_rxf1a_post_write(RegisterInfo *reg, uint64_t val)
{
    Stm32g474FdcanChannel *channel = reg->opaque;

    if (!stm32g474_fdcan_in_reset(channel->parent) &&
        channel->parent->engines_initialized) {
        m_can_rx_fifo_ack(&channel->engine, 1,
                          FIELD_EX32(val, RXF1A, F1AI));
        stm32g474_fdcan_sync_rx_fifo(channel, 1);
    }
}

static void
stm32g474_fdcan_txefa_post_write(RegisterInfo *reg, uint64_t val)
{
    Stm32g474FdcanChannel *channel = reg->opaque;

    if (!stm32g474_fdcan_in_reset(channel->parent) &&
        channel->parent->engines_initialized) {
        m_can_tx_event_ack(&channel->engine,
                           FIELD_EX32(val, TXEFA, EFAI));
        stm32g474_fdcan_sync_tx_event_fifo(channel);
    }
}

static uint64_t
stm32g474_fdcan_txbar_pre_write(RegisterInfo *reg, uint64_t val)
{
    Stm32g474FdcanChannel *channel = reg->opaque;

    if (channel->regs[R_CCCR] & R_CCCR_CCE_MASK) {
        return stm32g474_fdcan_register_value(reg);
    }
    return stm32g474_fdcan_register_value(reg) | val;
}

static void
stm32g474_fdcan_txbar_post_write(RegisterInfo *reg, uint64_t val)
{
    Stm32g474FdcanChannel *channel = reg->opaque;
    uint32_t request = val & STM32G474_FDCAN_TX_BUFFER_MASK;

    channel->regs[R_TXBAR] = 0;
    if (stm32g474_fdcan_in_reset(channel->parent)) {
        return;
    }

    channel->regs[R_TXBRP] |= request;
    channel->regs[R_TXBTO] &= ~request;
    channel->regs[R_TXBCF] &= ~request;
    stm32g474_fdcan_sync_tx_queue(channel);
}

static uint64_t
stm32g474_fdcan_txbcr_pre_write(RegisterInfo *reg, uint64_t val)
{
    Stm32g474FdcanChannel *channel = reg->opaque;
    uint32_t pending = channel->regs[R_TXBRP];

    if (channel->regs[R_CCCR] & R_CCCR_CCE_MASK) {
        return stm32g474_fdcan_register_value(reg);
    }
    return stm32g474_fdcan_register_value(reg) | (val & pending);
}

static void
stm32g474_fdcan_txbcr_post_write(RegisterInfo *reg, uint64_t val)
{
    Stm32g474FdcanChannel *channel = reg->opaque;
    uint32_t cancelled =
        val & channel->regs[R_TXBRP] &
        STM32G474_FDCAN_TX_BUFFER_MASK;

    if (stm32g474_fdcan_in_reset(channel->parent)) {
        channel->regs[R_TXBCR] = 0;
        return;
    }

    channel->regs[R_TXBRP] &= ~cancelled;
    channel->regs[R_TXBCF] |= cancelled;
    channel->regs[R_TXBCR] &= channel->regs[R_TXBRP];
    if (cancelled & channel->regs[R_TXBCIE]) {
        channel->regs[R_IR] |= R_IR_TCF_MASK;
    }
    stm32g474_fdcan_sync_tx_queue(channel);
    stm32g474_fdcan_update_irq(channel);
}

static uint64_t
stm32g474_fdcan_ckdiv_pre_write(RegisterInfo *reg, uint64_t val)
{
    Stm32g474FdcanChannel *channel = reg->opaque;

    if (channel->regs[R_CCCR] & R_CCCR_CCE_MASK) {
        return val;
    }
    return stm32g474_fdcan_register_value(reg);
}

static const RegisterAccessInfo stm32g474_fdcan_regs_info[] = {
    {
        .name = "CREL",
        .addr = A_CREL,
        .reset = 0x32141218,
        .ro = UINT32_MAX,
    }, {
        .name = "ENDN",
        .addr = A_ENDN,
        .reset = 0x87654321,
        .ro = UINT32_MAX,
    }, {
        .name = "DBTP",
        .addr = A_DBTP,
        .reset = 0x00000a33,
        .rsvd = STM32G474_FDCAN_RSVD(0x009f1fff),
        .pre_write = stm32g474_fdcan_protected_pre_write,
    }, {
        .name = "TEST",
        .addr = A_TEST,
        .ro = R_TEST_RX_MASK,
        .rsvd = STM32G474_FDCAN_RSVD(0x000000f0),
        .pre_write = stm32g474_fdcan_test_pre_write,
    }, {
        .name = "RWD",
        .addr = A_RWD,
        .ro = R_RWD_WDV_MASK,
        .rsvd = STM32G474_FDCAN_RSVD(0x0000ffff),
        .pre_write = stm32g474_fdcan_protected_pre_write,
    }, {
        .name = "CCCR",
        .addr = A_CCCR,
        .reset = 0x00000001,
        .ro = R_CCCR_CSA_MASK,
        .rsvd = STM32G474_FDCAN_RSVD(0x0000f3ff),
        .pre_write = stm32g474_fdcan_cccr_pre_write,
        .post_write = stm32g474_fdcan_cccr_post_write,
    }, {
        .name = "NBTP",
        .addr = A_NBTP,
        .reset = 0x06000a03,
        .rsvd = STM32G474_FDCAN_RSVD(0xffffff7f),
        .pre_write = stm32g474_fdcan_protected_pre_write,
    }, {
        .name = "TSCC",
        .addr = A_TSCC,
        .rsvd = STM32G474_FDCAN_RSVD(0x000f0003),
        .pre_write = stm32g474_fdcan_protected_pre_write,
    }, {
        .name = "TSCV",
        .addr = A_TSCV,
        .rsvd = STM32G474_FDCAN_RSVD(0x0000ffff),
        .pre_write = stm32g474_fdcan_tscv_pre_write,
    }, {
        .name = "TOCC",
        .addr = A_TOCC,
        .reset = 0xffff0000,
        .rsvd = STM32G474_FDCAN_RSVD(0xffff0007),
        .pre_write = stm32g474_fdcan_protected_pre_write,
    }, {
        .name = "TOCV",
        .addr = A_TOCV,
        .reset = 0x0000ffff,
        .rsvd = STM32G474_FDCAN_RSVD(0x0000ffff),
        .pre_write = stm32g474_fdcan_tocv_pre_write,
    }, {
        .name = "ECR",
        .addr = A_ECR,
        .ro = 0x00ffffff,
        .cor = R_ECR_CEL_MASK,
        .rsvd = STM32G474_FDCAN_RSVD(0x00ffffff),
    }, {
        .name = "PSR",
        .addr = A_PSR,
        .reset = 0x00000707,
        .ro = 0x007f7fff,
        .rsvd = STM32G474_FDCAN_RSVD(0x007f7fff),
        .post_read = stm32g474_fdcan_psr_post_read,
    }, {
        .name = "TDCR",
        .addr = A_TDCR,
        .rsvd = STM32G474_FDCAN_RSVD(0x00007f7f),
        .pre_write = stm32g474_fdcan_protected_pre_write,
    }, {
        .name = "IR",
        .addr = A_IR,
        .w1c = STM32G474_FDCAN_IR_MASK,
        .rsvd = STM32G474_FDCAN_RSVD(STM32G474_FDCAN_IR_MASK),
        .post_write = stm32g474_fdcan_ir_post_write,
    }, {
        .name = "IE",
        .addr = A_IE,
        .rsvd = STM32G474_FDCAN_RSVD(STM32G474_FDCAN_IR_MASK),
        .post_write = stm32g474_fdcan_irq_post_write,
    }, {
        .name = "ILS",
        .addr = A_ILS,
        .rsvd = STM32G474_FDCAN_RSVD(STM32G474_FDCAN_ILS_MASK),
        .post_write = stm32g474_fdcan_irq_post_write,
    }, {
        .name = "ILE",
        .addr = A_ILE,
        .rsvd = STM32G474_FDCAN_RSVD(0x00000003),
        .post_write = stm32g474_fdcan_irq_post_write,
    }, {
        .name = "RXGFC",
        .addr = A_RXGFC,
        .rsvd = STM32G474_FDCAN_RSVD(0x0f1f033f),
        .pre_write = stm32g474_fdcan_protected_pre_write,
    }, {
        .name = "XIDAM",
        .addr = A_XIDAM,
        .reset = 0x1fffffff,
        .rsvd = STM32G474_FDCAN_RSVD(0x1fffffff),
        .pre_write = stm32g474_fdcan_protected_pre_write,
    }, {
        .name = "HPMS",
        .addr = A_HPMS,
        .ro = 0x00009fc7,
        .rsvd = STM32G474_FDCAN_RSVD(0x00009fc7),
    }, {
        .name = "RXF0S",
        .addr = A_RXF0S,
        .ro = 0x0303030f,
        .rsvd = STM32G474_FDCAN_RSVD(0x0303030f),
    }, {
        .name = "RXF0A",
        .addr = A_RXF0A,
        .rsvd = STM32G474_FDCAN_RSVD(0x00000007),
        .post_write = stm32g474_fdcan_rxf0a_post_write,
    }, {
        .name = "RXF1S",
        .addr = A_RXF1S,
        .ro = 0x0303030f,
        .rsvd = STM32G474_FDCAN_RSVD(0x0303030f),
    }, {
        .name = "RXF1A",
        .addr = A_RXF1A,
        .rsvd = STM32G474_FDCAN_RSVD(0x00000007),
        .post_write = stm32g474_fdcan_rxf1a_post_write,
    }, {
        .name = "TXBC",
        .addr = A_TXBC,
        .rsvd = STM32G474_FDCAN_RSVD(0x01000000),
        .pre_write = stm32g474_fdcan_protected_pre_write,
    }, {
        .name = "TXFQS",
        .addr = A_TXFQS,
        .reset = 0x00000003,
        .ro = 0x00230307,
        .rsvd = STM32G474_FDCAN_RSVD(0x00230307),
    }, {
        .name = "TXBRP",
        .addr = A_TXBRP,
        .ro = STM32G474_FDCAN_TX_BUFFER_MASK,
        .rsvd = STM32G474_FDCAN_RSVD(
            STM32G474_FDCAN_TX_BUFFER_MASK),
    }, {
        .name = "TXBAR",
        .addr = A_TXBAR,
        .rsvd = STM32G474_FDCAN_RSVD(
            STM32G474_FDCAN_TX_BUFFER_MASK),
        .pre_write = stm32g474_fdcan_txbar_pre_write,
        .post_write = stm32g474_fdcan_txbar_post_write,
    }, {
        .name = "TXBCR",
        .addr = A_TXBCR,
        .rsvd = STM32G474_FDCAN_RSVD(
            STM32G474_FDCAN_TX_BUFFER_MASK),
        .pre_write = stm32g474_fdcan_txbcr_pre_write,
        .post_write = stm32g474_fdcan_txbcr_post_write,
    }, {
        .name = "TXBTO",
        .addr = A_TXBTO,
        .ro = STM32G474_FDCAN_TX_BUFFER_MASK,
        .rsvd = STM32G474_FDCAN_RSVD(
            STM32G474_FDCAN_TX_BUFFER_MASK),
    }, {
        .name = "TXBCF",
        .addr = A_TXBCF,
        .ro = STM32G474_FDCAN_TX_BUFFER_MASK,
        .rsvd = STM32G474_FDCAN_RSVD(
            STM32G474_FDCAN_TX_BUFFER_MASK),
    }, {
        .name = "TXBTIE",
        .addr = A_TXBTIE,
        .rsvd = STM32G474_FDCAN_RSVD(
            STM32G474_FDCAN_TX_BUFFER_MASK),
    }, {
        .name = "TXBCIE",
        .addr = A_TXBCIE,
        .rsvd = STM32G474_FDCAN_RSVD(
            STM32G474_FDCAN_TX_BUFFER_MASK),
    }, {
        .name = "TXEFS",
        .addr = A_TXEFS,
        .ro = 0x03030307,
        .rsvd = STM32G474_FDCAN_RSVD(0x03030307),
    }, {
        .name = "TXEFA",
        .addr = A_TXEFA,
        .rsvd = STM32G474_FDCAN_RSVD(0x00000003),
        .post_write = stm32g474_fdcan_txefa_post_write,
    }, {
        .name = "CKDIV",
        .addr = A_CKDIV,
        .rsvd = STM32G474_FDCAN_RSVD(0x0000000f),
        .pre_write = stm32g474_fdcan_ckdiv_pre_write,
    },
};

G_STATIC_ASSERT(ARRAY_SIZE(stm32g474_fdcan_regs_info) ==
                STM32G474_FDCAN_COMMON_NUM_DESCRIPTORS + 1);
G_STATIC_ASSERT(STM32G474_FDCAN_NUM_REGS == R_CKDIV + 1);
G_STATIC_ASSERT(ARRAY_SIZE(stm32g474_fdcan_irq_group_masks) ==
                STM32G474_FDCAN_NUM_IRQ_GROUPS);
G_STATIC_ASSERT(ARRAY_SIZE(stm32g474_fdcan_engine_event_ir) == 10);

static void stm32g474_fdcan_write(void *opaque, hwaddr addr,
                                  uint64_t value, unsigned int size)
{
    RegisterInfoArray *reg_array = opaque;
    Stm32g474FdcanState *s = STM32G474_FDCAN(
        register_array_get_owner(reg_array));

    if (!stm32g474_fdcan_in_reset(s)) {
        register_write_memory(opaque, addr, value, size);
    }
}

