zevorn/qemu/hw/net/can/stm32g474_fdcan.c
static const MemoryRegionOps stm32g474_fdcan_ops = {
    .read = register_read_memory,
    .write = stm32g474_fdcan_write,
    .endianness = DEVICE_LITTLE_ENDIAN,
    .valid = {
        .min_access_size = 4,
        .max_access_size = 4,
        .unaligned = false,
    },
    .impl = {
        .min_access_size = 4,
        .max_access_size = 4,
        .unaligned = false,
    },
};

static void
stm32g474_fdcan_reset_registers(Stm32g474FdcanState *s)
{
    for (unsigned int channel_index = 0;
         channel_index < STM32G474_FDCAN_NUM_CHANNELS;
         channel_index++) {
        Stm32g474FdcanChannel *channel =
            &s->channel[channel_index];

        for (int i = 0; i < channel->reg_array->num_elements; i++) {
            register_reset(channel->reg_array->r[i]);
        }
        if (s->engines_initialized) {
            m_can_engine_reset(&channel->engine);
        }
        channel->cccr_old = 0;
        channel->cccr_write_pending = false;
        qemu_set_irq(channel->irq[0], 0);
        qemu_set_irq(channel->irq[1], 0);
    }
}

static void
stm32g474_fdcan_reset_input(void *opaque, int n, int level)
{
    Stm32g474FdcanState *s = STM32G474_FDCAN(opaque);
    bool asserted = level != 0;
    bool was_resetting;

    if (asserted == s->peripheral_reset_asserted) {
        return;
    }

    s->peripheral_reset_asserted = asserted;
    if (!asserted) {
        return;
    }

    was_resetting = s->resetting;
    s->resetting = true;
    stm32g474_fdcan_reset_registers(s);
    s->resetting = was_resetting;
}

static void stm32g474_fdcan_reset_enter(Object *obj, ResetType type)
{
    Stm32g474FdcanState *s = STM32G474_FDCAN(obj);

    s->resetting = true;
}

static void stm32g474_fdcan_reset_hold(Object *obj, ResetType type)
{
    Stm32g474FdcanState *s = STM32G474_FDCAN(obj);

    stm32g474_fdcan_reset_registers(s);
    s->peripheral_reset_asserted = false;
}

static void stm32g474_fdcan_reset_exit(Object *obj, ResetType type)
{
    Stm32g474FdcanState *s = STM32G474_FDCAN(obj);

    s->resetting = false;
    if (!s->engines_initialized) {
        return;
    }

    for (unsigned int i = 0;
         i < STM32G474_FDCAN_NUM_CHANNELS; i++) {
        stm32g474_fdcan_sync_dynamic_status(&s->channel[i]);
        stm32g474_fdcan_update_irq(&s->channel[i]);
    }
}

static bool
stm32g474_fdcan_fifo_state_valid(const MCanFifoState *state,
                                  unsigned int capacity)
{
    return state->fill <= capacity &&
           state->get_index < capacity &&
           state->put_index < capacity;
}

static bool
stm32g474_fdcan_channel_state_valid(Stm32g474FdcanChannel *channel)
{
    for (unsigned int i = 0; i < ARRAY_SIZE(channel->regs); i++) {
        RegisterInfo *reg = &channel->regs_info[i];

        if (!reg->access && channel->regs[i]) {
            return false;
        }
        if (reg->access && (channel->regs[i] & reg->access->rsvd)) {
            return false;
        }
    }

    if (!(channel->regs[R_CCCR] & R_CCCR_INIT_MASK) &&
        (channel->regs[R_CCCR] & R_CCCR_CCE_MASK)) {
        return false;
    }
    if (!stm32g474_fdcan_fifo_state_valid(
            &channel->engine.rx_fifo[0],
            stm32g474_fdcan_mram_layout.rx_elements[0]) ||
        !stm32g474_fdcan_fifo_state_valid(
            &channel->engine.rx_fifo[1],
            stm32g474_fdcan_mram_layout.rx_elements[1]) ||
        !stm32g474_fdcan_fifo_state_valid(
            &channel->engine.tx_event_fifo,
            stm32g474_fdcan_mram_layout.tx_events)) {
        return false;
    }
    if (channel->engine.high_priority.storage >
        M_CAN_HIGH_PRIORITY_FIFO1) {
        return false;
    }
    if ((channel->engine.high_priority.storage ==
         M_CAN_HIGH_PRIORITY_FIFO0 ||
         channel->engine.high_priority.storage ==
         M_CAN_HIGH_PRIORITY_FIFO1) &&
        channel->engine.high_priority.buffer_index >=
        stm32g474_fdcan_mram_layout.rx_elements[
            channel->engine.high_priority.storage -
            M_CAN_HIGH_PRIORITY_FIFO0]) {
        return false;
    }
    if ((channel->engine.high_priority.storage ==
         M_CAN_HIGH_PRIORITY_NO_FIFO ||
         channel->engine.high_priority.storage ==
         M_CAN_HIGH_PRIORITY_FIFO_LOST) &&
        channel->engine.high_priority.buffer_index != 0) {
        return false;
    }
    if (channel->engine.high_priority.valid &&
        channel->engine.high_priority.filter_index >=
        (channel->engine.high_priority.extended ?
         stm32g474_fdcan_mram_layout.ext_filters :
         stm32g474_fdcan_mram_layout.std_filters)) {
        return false;
    }
    return true;
}

static int stm32g474_fdcan_post_load(void *opaque, int version_id)
{
    Stm32g474FdcanState *s = STM32G474_FDCAN(opaque);

    s->resetting = true;
    for (unsigned int i = 0;
         i < STM32G474_FDCAN_NUM_CHANNELS; i++) {
        Stm32g474FdcanChannel *channel = &s->channel[i];

        channel->cccr_old = 0;
        channel->cccr_write_pending = false;
        if (!stm32g474_fdcan_channel_state_valid(channel)) {
            s->resetting = false;
            return -EINVAL;
        }
    }

    if (s->peripheral_reset_asserted) {
        stm32g474_fdcan_reset_registers(s);
        s->resetting = false;
        return 0;
    }

    s->resetting = false;
    for (unsigned int i = 0;
         i < STM32G474_FDCAN_NUM_CHANNELS; i++) {
        stm32g474_fdcan_sync_cccr_status(&s->channel[i]);
        stm32g474_fdcan_sync_dynamic_status(&s->channel[i]);
        stm32g474_fdcan_update_irq(&s->channel[i]);
    }
    return 0;
}

static const VMStateDescription vmstate_stm32g474_fdcan_channel = {
    .name = "stm32g474-fdcan-channel",
    .version_id = 1,
    .minimum_version_id = 1,
    .fields = (const VMStateField[]) {
        VMSTATE_UINT32_ARRAY(regs, Stm32g474FdcanChannel,
                             STM32G474_FDCAN_NUM_REGS),
        VMSTATE_STRUCT(engine, Stm32g474FdcanChannel, 0,
                       vmstate_m_can_engine, MCanEngine),
        VMSTATE_END_OF_LIST()
    },
};

static const VMStateDescription vmstate_stm32g474_fdcan = {
    .name = TYPE_STM32G474_FDCAN,
    .version_id = 1,
    .minimum_version_id = 1,
    .post_load = stm32g474_fdcan_post_load,
    .fields = (const VMStateField[]) {
        VMSTATE_STRUCT_ARRAY(channel, Stm32g474FdcanState,
                             STM32G474_FDCAN_NUM_CHANNELS, 0,
                             vmstate_stm32g474_fdcan_channel,
                             Stm32g474FdcanChannel),
        VMSTATE_BOOL(peripheral_reset_asserted,
                     Stm32g474FdcanState),
        VMSTATE_CLOCK(kernel_clk, Stm32g474FdcanState),
        VMSTATE_CLOCK(pclk, Stm32g474FdcanState),
        VMSTATE_END_OF_LIST()
    },
};

static void
stm32g474_fdcan_realize(DeviceState *dev, Error **errp)
{
    Stm32g474FdcanState *s = STM32G474_FDCAN(dev);

