zevorn/qemu/hw/net/can/stm32g474_fdcan.c
    if (!clock_has_source(s->kernel_clk)) {
        error_setg(errp, TYPE_STM32G474_FDCAN
                   ": kernel-clk clock must be connected");
        return;
    }
    if (!clock_has_source(s->pclk)) {
        error_setg(errp, TYPE_STM32G474_FDCAN
                   ": pclk clock must be connected");
        return;
    }
    if (!memory_region_init_ram(&s->message_ram, OBJECT(dev),
                                TYPE_STM32G474_FDCAN ".message-ram",
                                STM32G474_FDCAN_MRAM_SIZE, errp)) {
        return;
    }

    s->message_ram_ptr = memory_region_get_ram_ptr(&s->message_ram);
    for (unsigned int i = 0;
         i < STM32G474_FDCAN_NUM_CHANNELS; i++) {
        uint8_t *slice =
            s->message_ram_ptr +
            i * STM32G474_FDCAN_CHANNEL_MRAM_SIZE;

        if (!m_can_engine_init(
                &s->channel[i].engine, slice,
                STM32G474_FDCAN_CHANNEL_MRAM_SIZE,
                &stm32g474_fdcan_mram_layout,
                &stm32g474_fdcan_engine_ops, &s->channel[i])) {
            error_setg(errp, TYPE_STM32G474_FDCAN
                       ": invalid message RAM layout for channel %u",
                       i + 1);
            return;
        }
    }
    s->engines_initialized = true;
    sysbus_init_mmio(SYS_BUS_DEVICE(dev), &s->message_ram);
}

static const Property stm32g474_fdcan_properties[] = {
    DEFINE_PROP_LINK("canbus0", Stm32g474FdcanState, canbus[0],
                     TYPE_CAN_BUS, CanBusState *),
    DEFINE_PROP_LINK("canbus1", Stm32g474FdcanState, canbus[1],
                     TYPE_CAN_BUS, CanBusState *),
    DEFINE_PROP_LINK("canbus2", Stm32g474FdcanState, canbus[2],
                     TYPE_CAN_BUS, CanBusState *),
};

static void stm32g474_fdcan_init(Object *obj)
{
    Stm32g474FdcanState *s = STM32G474_FDCAN(obj);
    DeviceState *dev = DEVICE(obj);
    SysBusDevice *sbd = SYS_BUS_DEVICE(obj);

    for (unsigned int i = 0;
         i < STM32G474_FDCAN_NUM_CHANNELS; i++) {
        Stm32g474FdcanChannel *channel = &s->channel[i];
        unsigned int num_descriptors =
            STM32G474_FDCAN_COMMON_NUM_DESCRIPTORS + (i == 0);

        channel->parent = s;
        channel->index = i;
        channel->reg_array = register_init_block32(
            dev, stm32g474_fdcan_regs_info, num_descriptors,
            channel->regs_info, channel->regs,
            &stm32g474_fdcan_ops, false,
            STM32G474_FDCAN_MMIO_SIZE);
        for (int reg = 0;
             reg < channel->reg_array->num_elements; reg++) {
            channel->reg_array->r[reg]->opaque = channel;
        }
        sysbus_init_mmio(sbd, &channel->reg_array->mem);
        for (unsigned int irq = 0;
             irq < STM32G474_FDCAN_NUM_IRQS; irq++) {
            sysbus_init_irq(sbd, &channel->irq[irq]);
        }
    }

    s->kernel_clk = qdev_init_clock_in(dev, "kernel-clk",
                                       NULL, NULL, 0);
    s->pclk = qdev_init_clock_in(dev, "pclk", NULL, NULL, 0);
    qdev_init_gpio_in_named(dev, stm32g474_fdcan_reset_input,
                            "reset", 1);
}

static void
stm32g474_fdcan_class_init(ObjectClass *klass, const void *data)
{
    DeviceClass *dc = DEVICE_CLASS(klass);
    ResettableClass *rc = RESETTABLE_CLASS(klass);

    dc->realize = stm32g474_fdcan_realize;
    dc->vmsd = &vmstate_stm32g474_fdcan;
    dc->user_creatable = false;
    device_class_set_props(dc, stm32g474_fdcan_properties);
    rc->phases.enter = stm32g474_fdcan_reset_enter;
    rc->phases.hold = stm32g474_fdcan_reset_hold;
    rc->phases.exit = stm32g474_fdcan_reset_exit;
}

static const TypeInfo stm32g474_fdcan_info = {
    .name = TYPE_STM32G474_FDCAN,
    .parent = TYPE_SYS_BUS_DEVICE,
    .instance_size = sizeof(Stm32g474FdcanState),
    .instance_init = stm32g474_fdcan_init,
    .class_init = stm32g474_fdcan_class_init,
};

static void stm32g474_fdcan_register_types(void)
{
    type_register_static(&stm32g474_fdcan_info);
}

type_init(stm32g474_fdcan_register_types)
